bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY4.xml
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>


        <interrupts>
            <interrupt index="0" name="RESET" caption="External Reset, Power-on Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="2" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
            <interrupt index="3" name="TIM0_CAPT" caption="Timer/Counter0 Input Capture"/>
            <interrupt index="4" name="TIM0_OVF" caption="Timer/Counter0 Overflow"/>
            <interrupt index="5" name="TIM0_COMPA" caption="Timer/Counter Compare Match A"/>
            <interrupt index="6" name="TIM0_COMPB" caption="Timer/Counter Compare Match B"/>
            <interrupt index="7" name="ANA_COMP" caption="Analog Comparator"/>
            <interrupt index="8" name="WDT" caption="Watchdog Time-out"/>
            <interrupt index="9" name="VLM" caption="Vcc Voltage Level Monitor"/>
        </interrupts>
        <interfaces>
            <interface name="TPI" type="tpi"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x8f"/>
                <property name="SIGNATURE2" value="0x0a"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="BYTE0" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Output external clock" mask="0x04" name="CKOUT"/>
                    <bitfield caption="Watch dog timer always on" mask="0x02" name="WDTON"/>
                    <bitfield caption="Disable external reset" mask="0x01" name="RSTDISBL"/>
                </register>
            </register-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x1F" size="1">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture  Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="" name="DIDR0" offset="0x17" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Configuration Change Protection" name="CCP" offset="0x3C" size="1" mask="0xFF"/>
                <register caption="Stack Pointer " name="SP" offset="0x3D" size="2" mask="0xFFFF"/>
                <register caption="Status Register" name="SREG" offset="0x3F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Clock Main Settings Register" name="CLKMSR" offset="0x37" size="1">
                    <bitfield caption="Clock Main Select Bits" mask="0x03" name="CLKMS"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPSR" offset="0x36" size="1">
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
